CassiniSea/lcd-st7735-stm8s/main.c
		if (currentError < (float)variables[VARIABLE_KP].value && currentError > -(float)variables[VARIABLE_KP].value) {
			integralError += currentError * (float)variables[VARIABLE_KI].value;
			
			if (integralError > I_MAX)  integralError = I_MAX;
			if (integralError < -I_MAX) integralError = -I_MAX;
		}
		else {
			integralError = 0.0f;
		}
		
		predictedTemp = temperature + (tempSpeed * (float)variables[VARIABLE_KD].value) - integralError;
		
		if(heaterState == 0) {
			if(predictedTemp < (float)variables[VARIABLE_TEMP].value) {
				GPIO_WriteHigh(GPIOD, GPIO_PIN_4);
				color = ST7735_RED;
				heaterState = 1;
			}
		}
		else {
			if(predictedTemp >= (float)variables[VARIABLE_TEMP].value) {
				GPIO_WriteLow(GPIOD, GPIO_PIN_4);
				color = ST7735_GREEN;		
				heaterState = 0;
			}
		}		
		
		UI_DrawNumber(
			40,
			SCREEN_HEIGHT - 3 * (FONT_HEIGHT + 3),
			(uint16_t)temperature,
			color,
			UI_PANEL_COLOR
		);
	}
	
	TIM1_ClearITPendingBit(TIM1_IT_UPDATE);
	//graphPushValue();
	
	/*	
	scroll_position++;
	if (scroll_position >= SCREEN_HEIGHT - GRAPH_TOP) {
		scroll_position = SCREEN_HEIGHT - GRAPH_TOP - GRAPH_HEIGHT;
	}
	
	if(isInitComplate == TRUE) {	
		ST7735_SetScrollStart(scroll_position);
	}
	*/
}

@far @interrupt void tim4UpdateInterrupt(void) {
	TIM4_ClearITPendingBit(TIM1_IT_UPDATE);
	
	if (buttonsDebounce) {
    buttonsDebounce--;

    if (buttonsDebounce == 0) {
			programEvent |= getButtonsState();
    }
	}	
}

@far @interrupt void gpioaExtiInterrupt(void) {
	buttonsDebounce = BUTTONS_DEBOUNCE_LIMIT;
}

@far @interrupt void gpiocExtiInterrupt(void) {	
	buttonsDebounce = BUTTONS_DEBOUNCE_LIMIT;
}

void uartReceiveByte(uint8_t byte) {
	uartSendByte(byte);
//	ST7735_SetScrollStart((uint16_t)byte);
}